{"model":"core.Books_seller","fields":{"Title":"The Da Vinci Code","Author":"Dan Brown","Description":"Harvard professor Robert Langdon receives an urgent late-night phone call while on business in Paris: the elderly curator of the Louvre, Jacques Sauni're, has been brutally murdered inside the museum. Alongside the body, police have found a series of baffling codes. As Langdon and a gifted French cryptologist, Sophie Neveu, begin to sort through the bizarre riddles, they are stunned to find a trail that leads to the works of Leonardo Da Vinci - and suggests the answer to a mystery that stretches deep into the vault of history. Langdon suspects the late curator was involved in the Priory of Sion - a centuries old secret society - and has sacrificed his life to protect the Priory's most sacred trust: the location of a vastly important religious relic hidden for centuries. But it now appears that Opus Dei, a clandestine sect that has long plotted to seize the Prirory's secret, has now made its move. Unless Langdon and Neveu can decipher the labyrinthine code and quickly assemble the pieces of the puzzle, the Priory's secret - and a stunning historical truth - will be lost forever. Breaking the mould of traditional suspense novels, The DA VINCI CODE is simultaneously lightning-paced, intelligent and intricately layered with remarkable research and detail. And in this exclusive edition Dan Brown allows the reader behind the scenes of the novel which now incorporates over 150 photographs and illustrations throughout the text showing the rich historical tapestry from which he drew his inspiration. The visual sources which provide both the backdrop and the stimulus for the novel's action are revealed for the first time and uniquely complement the reading experience.","Image_Url":"http:\/\/books.google.com\/books\/content?id=A-AS46wG0p8C&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Harry Potter and the Deathly Hallows","Author":"J. K. Rowling","Description":"\"The final adventure in J.K. Rowling's phenomenal, best-selling Harry Potter book series\"--Provided by publisher.","Image_Url":"http:\/\/books.google.com\/books\/content?id=JHEkAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Harry Potter and the Philosopher's Stone","Author":"Harry Potter and the Philosopher's Stone","Description":"No description available.","Image_Url":""}}
{"model":"core.Books_seller","fields":{"Title":"Harry Potter and the Order of the Phoenix","Author":"J.K. Rowling","Description":"'You are sharing the Dark Lord's thoughts and emotions. The Headmaster thinks it inadvisable for this to continue. He wishes me to teach you how to close your mind to the Dark Lord.' Dark times have come to Hogwarts. After the Dementors' attack on his cousin Dudley, Harry Potter knows that Voldemort will stop at nothing to find him. There are many who deny the Dark Lord's return, but Harry is not alone: a secret order gathers at Grimmauld Place to fight against the Dark forces. Harry must allow Professor Snape to teach him how to protect himself from Voldemort's savage assaults on his mind. But they are growing stronger by the day and Harry is running out of time... Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.","Image_Url":"http:\/\/books.google.com\/books\/content?id=zpvysRGsBlwC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Fifty Shades of Grey Fedora","Author":"Robert J. Randisi","Description":"Heat has always sizzled between private investigators and the femme fatales who walk through their doors. But in this startling, original anthology, these 17 authors—many of them winners of the prestigious Shamus Award—from sizzle to steamy, illustrating that sex and crime not only go hand in hand, but reaches far deeper into the stirrings of the heart From classic detective tales by Max Allan Collins and Parnell Hall, to tales of infidelity and suspicion from Terrill Lee Lankford and David Housewright, to surprising stories of female detectives by M. Ruth Myers to Sara Paretsky, here is a sexy, bawdy spin on the art of detection and the law of attraction. Other clever and seductive tales are presented by Carolina Garcia-Aquilera, Justin Scott, Gary Phillips, Jerry Kennealy, Michael Bracken, Christine Matthews, Robert J. Randisi, Warren Murphy, Ted Fitzgerald, Dick Lochte, and John Lutz. In all, these sexy damsels in distress and their all-too-willing investigators give new meaning to the term private…uh, you know. Fifty Shades of Grey Fedora will steam up even the most mundane stakeout.","Image_Url":"http:\/\/books.google.com\/books\/content?id=g8G3BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Harry Potter and the Goblet of Fire","Author":"J.K. Rowling","Description":"'There will be three tasks, spaced throughout the school year, and they will test the champions in many different ways ... their magical prowess - their daring - their powers of deduction - and, of course, their ability to cope with danger.' The Triwizard Tournament is to be held at Hogwarts. Only wizards who are over seventeen are allowed to enter - but that doesn't stop Harry dreaming that he will win the competition. Then at Hallowe'en, when the Goblet of Fire makes its selection, Harry is amazed to find his name is one of those that the magical cup picks out. He will face death-defying tasks, dragons and Dark wizards, but with the help of his best friends, Ron and Hermione, he might just make it through - alive! Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.","Image_Url":"http:\/\/books.google.com\/books\/content?id=etukl7GfrxQC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Harry Potter and the Chamber of Secrets","Author":"J. K. Rowling","Description":"Witchcraft, wizardry - fiction.","Image_Url":"http:\/\/books.google.com\/books\/content?id=nmXTy4FPfcwC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Harry Potter and the Prisoner of Azkaban","Author":"Patrick Keating","Description":"An essential work of twenty-first-century cinema, Alfonso Cuarón’s 2004 film Harry Potter and the Prisoner of Azkaban is an elegant exemplar of contemporary cinematic trends, including serial storytelling, the rise of the fantasy genre, digital filmmaking, and collaborative authorship. With craft, wonder, and wit, the film captures the most engaging elements of the novel while artfully translating its literary point of view into cinematic terms that expand on the world established in the book series and previous films. In this book, Patrick Keating examines how Cuarón and his collaborators employ cinematography, production design, music, performance, costume, dialogue, and more to create the richly textured world of Harry Potter—a world filtered principally through Harry’s perspective, characterized by gaps, uncertainties, and surprises. Rather than upholding the vision of a single auteur, Keating celebrates Cuarón’s direction as a collaborative achievement that resulted in a family blockbuster layered with thematic insights.","Image_Url":"http:\/\/books.google.com\/books\/content?id=1YcHEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Angels and Demons in Art","Author":"Rosa Giorgi","Description":"This sumptuously illustrated volume analyzes artists' representations of angels and demons and heaven and hell from the Judeo-Christian tradition and describes how these artistic portrayals evolved over time. As with other books in the Guide to Imagery series, the goal of this volume is to help contemporary art enthusiasts decode the symbolic meanings in the great masterworks of Western Art. The first chapter traces the development of images of the Creation and the Afterworld from descriptions of them in the Scriptures through their evolution in later literary and philosophical works. The following two chapters examine artists' depictions of the two paths that humans may take, the path of evil or the path of salvation, and the punishments or rewards found on each. A chapter on the Judgment Day and the end of the world explores portrayals of the mysterious worlds between life and death and in the afterlife. Finally, the author looks at images of angelic and demonic beings themselves and how they came to be portrayed with the physical attributes--wings, halos, horns, and cloven hooves--with which we are now so familiar. Thoroughly researched by and expert in the field of iconography, Angels and Demons in Art will delight readers with an interest in art or religious symbolism.","Image_Url":"http:\/\/books.google.com\/books\/content?id=PEyRIARaKhAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Harry Potter and the Half-Blood Prince","Author":"J. K. Rowling, Mary GrandPré","Description":"As classes continue for sixth-year students at Hogwarts, Harry Potter searches for the full and complex story of the boy who became Lord Voldemort, thereby finding what may be his only vulnerability. Harry Potter series #6.","Image_Url":"http:\/\/books.google.com\/books\/content?id=7-VWPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Fifty Shades Darker","Author":"E. L. James","Description":"After a brief break-up, Anastasia and Christian change their arrangement and both wrestle with their inner demons, as Anastasia tries to make an important decision.","Image_Url":"http:\/\/books.google.com\/books\/content?id=14DhlAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Twilight","Author":"Stephenie Meyer","Description":"Fall in love with the addictive, suspenseful love story between a teenage girl and a vampire with the book that sparked a \"literary phenomenon\" and redefined romance for a generation (New York Times). Isabella Swan's move to Forks, a small, perpetually rainy town in Washington, could have been the most boring move she ever made. But once she meets the mysterious and alluring Edward Cullen, Isabella's life takes a thrilling and terrifying turn. Up until now, Edward has managed to keep his vampire identity a secret in the small community he lives in, but now nobody is safe, especially Isabella, the person Edward holds most dear. The lovers find themselves balanced precariously on the point of a knife -- between desire and danger. Deeply romantic and extraordinarily suspenseful, Twilight captures the struggle between defying our instincts and satisfying our desires. This is a love story with bite. It's here! #1 bestselling author Stephenie Meyer makes a triumphant return to the world of Twilight with the highly anticipated companion, Midnight Sun: the iconic love story of Bella and Edward told from the vampire's point of view. \"People do not want to just read Meyer's books; they want to climb inside them and live there.\" -- Time \"A literary phenomenon.\" -- The New York Times","Image_Url":"http:\/\/books.google.com\/books\/content?id=PY40AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Psychology of the Girl with the Dragon Tattoo","Author":"Robin S. Rosenberg, Shannon O'Neill","Description":"Lisbeth Salander, heroine of Stieg Larsson's The Girl with the Dragon Tattoo and its sequels, is one of the most compelling, complex characters of our time. Is she an avenging angel? A dangerous outlaw? What makes Salander tick, and why is our response to her—and to Larsson's Millennium trilogy—so strong? In The Psychology of the Girl with the Dragon Tattoo, 19 psychologists and psychiatrists attempt to do what even expert investigator Mikael Blomkvist could not: understand Lisbeth Salander. What does Lisbeth's infamous dragon tattoo really say about her? Why is Lisbeth so drawn to Mikael, and what would they both need to do to make a relationship work? How do we explain men like Martin Vanger, Nils Bjurman, and Alexander Zalachenko? Is Lisbeth just as sexist and as psychopathic as they are? What is it about Lisbeth that allows her to survive, even thrive, under extraordinary conditions? How is Lisbeth like a Goth-punk Rorschach test? And what do we learn about ourselves from what we see in her?","Image_Url":"http:\/\/books.google.com\/books\/content?id=XJgWYDTG88wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Fifty shades freed","Author":"","Description":"No description available.","Image_Url":""}}
{"model":"core.Books_seller","fields":{"Title":"The Lost Symbol","Author":"Dan Brown","Description":"THE #1 WORLDWIDE BESTSELLER FROM THE ICONIC AUTHOR OF THE DA VINCI CODE “Impossible to put down.” —The New York Times “Thrilling and entertaining, like the experience on a roller coaster.” —Los Angeles Times Famed Harvard symbologist Robert Langdon answers an unexpected summons to deliver a lecture at the U.S. Capitol Building. His plans are interrupted when a disturbing object—artfully encoded with five symbols—is discovered in the building. Langdon recognizes in the find an ancient invitation into a lost world of esoteric, potentially dangerous wisdom. When his mentor, Peter Solomon—a long-standing Mason and beloved philanthropist—is kidnapped, Langdon realizes that the only way to save Solomon is to accept the mystical invitation and plunge headlong into a clandestine world of Masonic secrets, hidden history, and one inconceivable truth . . . all under the watchful eye of a terrifying enemy. Robert Langdon returns in Inferno, Origin, and The Secret of Secrets (coming soon)!","Image_Url":"http:\/\/books.google.com\/books\/content?id=ucpxOA3LDWcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"New Moon","Author":"Stephenie Meyer","Description":"From evil vampires to a mysterious pack of wolves, new threats of danger and vengeance test Bella and Edward's romance in the second book of the irresistible Twilight saga. For Bella Swan, there is one thing more important than life itself: Edward Cullen. But being in love with a vampire is even more dangerous than Bella could ever have imagined. Edward has already rescued Bella from the clutches of one evil vampire, but now, as their daring relationship threatens all that is near and dear to them, they realize their troubles may be just beginning. Bella and Edward face a devastating separation, the mysterious appearance of dangerous wolves roaming the forest in Forks, a terrifying threat of revenge from a female vampire and a deliciously sinister encounter with Italy's reigning royal family of vampires, the Volturi. Passionate, riveting, and full of surprising twists and turns, this vampire love saga is well on its way to literary immortality. It's here! #1 bestselling author Stephenie Meyer makes a triumphant return to the world of Twilight with the highly anticipated companion, Midnight Sun: the iconic love story of Bella and Edward told from the vampire's point of view. \"People do not want to just read Meyer's books; they want to climb inside them and live there.\" -- Time \"A literary phenomenon.\" -- The New York Times","Image_Url":"http:\/\/books.google.com\/books\/content?id=ubA2AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Deception Point","Author":"Dan Brown","Description":"On the eve of a presidential race in which NASA's budget is a pivotal issue, the space agency announces the discovery of an ancient meteorite filled with fossils deep in the Arctic ice.","Image_Url":"http:\/\/books.google.com\/books\/content?id=1zC-xOnvBg4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"What Is an Eclipse?","Author":"Michael Portman","Description":"Millions of people watch images captured by the Mars rovers with fascination, inciting their interest in other planets and space technology. There are still many questions remaining about space and space exploration, some quite mysterious. Readers see these queries addressed, including whether we'll be able to settle on another planet someday, when our sun may burn out, and how a black hole forms. Captivating photographs, many from NASA's archives, accompany the text and highlight the breathtaking beauty of space. * High-interest topics attract reluctant readers * Vivid photographs aid in reading comprehension * Graphic organizers recap ideas * Suggested reading and websites provide readers with further learning opportunities * Glossary includes essential terms in science vocabulary","Image_Url":"http:\/\/books.google.com\/books\/content?id=LfCDAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Lovely Bones","Author":"Alice Sebold","Description":"Susie Salmon is just like any other young American girl. She wants to be beautiful, adores her charm bracelet and has a crush on a boy from school. There's one big difference though – Susie is dead. Add: Now she can only observe while her family manage their grief in their different ways. Susie is desperate to help them and there might be a way of reaching them... Alice Sebold's novel The Lovely Bones is a unique coming-of-age tale that captured the hearts of readers throughout the world. Award-winning playwright Bryony Lavery has adapted it for this unforgettable play about life after loss.","Image_Url":"http:\/\/books.google.com\/books\/content?id=w6H8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Curious Incident of the Dog in the Night-Time","Author":"Mark Haddon","Description":"NATIONAL BESTSELLER • A modern classic—both poignant and funny—about a boy with autism who sets out to solve the murder of a neighbor's dog and discovers unexpected truths about himself and the world. “Disorienting and reorienting the reader to devastating effect.... Suspenseful and harrowing.” —The New York Times Book Review Christopher John Francis Boone knows all the countries of the world and their capitals and every prime number up to 7,057. He relates well to animals but has no understanding of human emotions. He cannot stand to be touched. And he detests the color yellow. This improbable story of Christopher's quest to investigate the suspicious death of a neighborhood dog makes for one of the most captivating, unusual, and widely heralded novels in recent years.","Image_Url":"http:\/\/books.google.com\/books\/content?id=loC0vNA1a4IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"DIGITAL FORTRESS","Author":"DAN BROWN","Description":"When the National Security Agency s invincible code-breaking machine encounters a mysterious code it cannot break, the agency calls in its head cryptographer, Susan Fletcher, a brilliant, beautiful mathematician. What she uncovers sends shock waves through the corridors of power. The NSA is being held hostage not by guns or bombs, but by a code so complex that if released would cripple U.S. intelligence.nnCaught in an accelerating tempest of secrecy and lies, Fletcher battles to save the agency she believes in. Betrayed on all sides, she finds herself fighting not only for her country but for her life, and in the end, for the life of the man she loves एन.एस.ए. या संस्थेने एका महासंगणकाच्या साहाय्याने कोणत्याही गुप्त मजकुराचा भेद करून उलगडा करणारी यंत्रणा निर्माण केली. एका गूढमजकुराचा भेद मात्र त्यांच्या महासंगणकाला करता येईना. पाच मिनिटात होणारे त्याचे काम दिवस उलटून गेला तरी संपेना. ह्या संस्थेत सुसान नावाची एक सुंदर गणितज्ञ स्त्री होती. तिला त्या वेळी जे सत्य सापडले ते हादरवणारे होते; सत्तेच्या महामार्गावर भूकंप घडवणारे होते. एन.एस.ए. संस्थेला ओलीस धरले गेले होते. बॉम्बने नव्हे, शस्त्रांनी नव्हे, तर फक्त एका अगम्य अशा सॉफ्टवेअरच्या कार्यक्रमाने ओलीस धरलेले होते. सुसान संस्था वाचवण्यासाठी शर्थीने प्रयत्न करत होती. सारे अमेरिका राष्ट्र पांगळे होण्याची वेळ जवळ येत चालली होती. शेवटी तिलाच आपला जीव वाचवण्यासाठी धडपड करत पळापळ करावी लागली. तिची सर्व बाजूंनी फसवणूक झाली होती. तिला आपल्या प्रियकराची काळजी वाटू लागल्याने ती बेभान झाली होती.शेवटची लढाई कमालीची रोमहर्षक ठरली.","Image_Url":"http:\/\/books.google.com\/books\/content?id=Y2c8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"A Short History of Nearly Everything","Author":"Bill Bryson","Description":"One of the world’s most beloved writers and New York Times bestselling author of A Walk in the Woods and The Body takes his ultimate journey—into the most intriguing and intractable questions that science seeks to answer. In A Walk in the Woods, Bill Bryson trekked the Appalachian Trail—well, most of it. In A Sunburned Country, he confronted some of the most lethal wildlife Australia has to offer. Now, in his biggest book, he confronts his greatest challenge: to understand—and, if possible, answer—the oldest, biggest questions we have posed about the universe and ourselves. Taking as territory everything from the Big Bang to the rise of civilization, Bryson seeks to understand how we got from there being nothing at all to there being us. To that end, he has attached himself to a host of the world’s most advanced (and often obsessed) archaeologists, anthropologists, and mathematicians, travelling to their offices, laboratories, and field camps. He has read (or tried to read) their books, pestered them with questions, apprenticed himself to their powerful minds. A Short History of Nearly Everything is the record of this quest, and it is a sometimes profound, sometimes funny, and always supremely clear and entertaining adventure in the realms of human knowledge, as only Bill Bryson can render it. Science has never been more involving or entertaining.","Image_Url":"http:\/\/books.google.com\/books\/content?id=hhnIWGD5Zt0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Girl Who Played With Fire #1","Author":"Sylvain Runberg","Description":"Following a fall from grace, discredited journalist Mikael Blomkvist opted to take up a missing persons case. His investigation led him to a mysterious computer hacker, Lisbeth Salander, who is hell-bent on revenge against her legal guardian. After solving the case together, Salander helped Blomkvist to publish an expose in the Millennium, restoring his reputation. Realizing her affections for him were unrequited, Salander subsequently disappeared. But a year has passed, and Salander is back in Stockholm just as Blomkvist is on the brink of a major story…","Image_Url":"http:\/\/books.google.com\/books\/content?id=2vMxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Breaking Dawn","Author":"Stephenie Meyer","Description":"In the explosive finale to the epic romantic saga, Bella has one final choice to make. Should she stay mortal and strengthen her connection to the werewolves, or leave it all behind to become a vampire? When you loved the one who was killing you, it left you no options. How could you run, how could you fight, when doing so would hurt that beloved one? If your life was all you had to give, how could you not give it? If it was someone you truly loved? To be irrevocably in love with a vampire is both fantasy and nightmare woven into a dangerously heightened reality for Bella Swan. Pulled in one direction by her intense passion for Edward Cullen, and in another by her profound connection to werewolf Jacob Black, a tumultuous year of temptation, loss, and strife have led her to the ultimate turning point. Her imminent choice to either join the dark but seductive world of immortals or to pursue a fully human life has become the thread from which the fates of two tribes hangs. This astonishing, breathlessly anticipated conclusion to the Twilight Saga illuminates the secrets and mysteries of this spellbinding romantic epic. It's here! #1 bestselling author Stephenie Meyer makes a triumphant return to the world of Twilight with the highly anticipated companion, Midnight Sun: the iconic love story of Bella and Edward told from the vampire's point of view. \"People do not want to just read Meyer's books; they want to climb inside them and live there.\" -- Time \"A literary phenomenon.\" -- The New York Times","Image_Url":"http:\/\/books.google.com\/books\/content?id=fZQ0AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Very Hungry Caterpillar in Tuscany","Author":"Enzo Catarsi","Description":"No description available.","Image_Url":"http:\/\/books.google.com\/books\/content?id=vUr9DcB-FX4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"THE GRUFFALO","Author":"NARAYAN CHANGDER","Description":"If you need a free PDF practice set of this book for your studies, feel free to reach out to me at cbsenet4u@gmail.com, and I'll send you a copy!THE GRUFFALO MCQ (MULTIPLE CHOICE QUESTIONS) SERVES AS A VALUABLE RESOURCE FOR INDIVIDUALS AIMING TO DEEPEN THEIR UNDERSTANDING OF VARIOUS COMPETITIVE EXAMS, CLASS TESTS, QUIZ COMPETITIONS, AND SIMILAR ASSESSMENTS. WITH ITS EXTENSIVE COLLECTION OF MCQS, THIS BOOK EMPOWERS YOU TO ASSESS YOUR GRASP OF THE SUBJECT MATTER AND YOUR PROFICIENCY LEVEL. BY ENGAGING WITH THESE MULTIPLE-CHOICE QUESTIONS, YOU CAN IMPROVE YOUR KNOWLEDGE OF THE SUBJECT, IDENTIFY AREAS FOR IMPROVEMENT, AND LAY A SOLID FOUNDATION. DIVE INTO THE GRUFFALO MCQ TO EXPAND YOUR THE GRUFFALO KNOWLEDGE AND EXCEL IN QUIZ COMPETITIONS, ACADEMIC STUDIES, OR PROFESSIONAL ENDEAVORS. THE ANSWERS TO THE QUESTIONS ARE PROVIDED AT THE END OF EACH PAGE, MAKING IT EASY FOR PARTICIPANTS TO VERIFY THEIR ANSWERS AND PREPARE EFFECTIVELY.","Image_Url":"http:\/\/books.google.com\/books\/content?id=CybtCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Jamie's 30-Minute Meals","Author":"Jamie Oliver","Description":"Whip up delicious three-course meals in no time at all with the bestselling Jamie's 30-Minute Meals Jamie Oliver will teach you how to make good food super-fast in his game-changing guide to coordinating an entire meal without any fuss. _________ With 50 exciting, seasonal meal ideas, Jamie's 30 Minute Meals provides the essential collection of dishes for putting on the ultimate three-course meal without taking up your time. Not only that, Jamie also includes refreshing, light lunch recipes that you can put together in no time at all. These mouth-watering dishes include . . . - Melt-in-the-mouth SPRING LAMB and CHIANTI GRAVY - Mushroom risotto with spinach salad - Tender DUCK SALAD - Moreish LEMON and RASPBERRY CHEESECAKE - Creamy RICE PUDDING and STEWED FRUIT Jamie offers a tasty dish for every occasion, with recipes written to help you make the most of every single minute in the kitchen. With the help of Jamie Oliver and Jamie's 30-Minute Meals, you'll be amazed by what you're able to achieve. In Jamie's extensive collection of internationally loved and trusted cookbooks, this is the one about multitasking to cook whole meals, fast. _________ 'There is only one Jamie Oliver. Great to watch. Great to cook' Delia Smith","Image_Url":"http:\/\/books.google.com\/books\/content?id=hZA7DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Kite Runner Graphic Novel","Author":"Khaled Hosseini","Description":"The perennial bestseller-now available as a sensational new graphic novel. Since its publication in 2003, nearly 7 million readers have discovered The Kite Runner. Through Khaled Hosseini's brilliant writing, a previously unknown part of the world was brought to vivid life for readers. Now, in this beautifully illustrated graphic novel adaptation, Hosseini brings his compelling story to a new generation of readers.","Image_Url":"http:\/\/books.google.com\/books\/content?id=pVOMDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"One Day","Author":"David Nicholls","Description":"***Pre-order David Nicholls' new novel YOU ARE HERE now - Coming April 2024*** THE MULTI-MILLION COPY BESTSELLER, NOW A MAJOR NETFLIX SERIES 'A wonderful, wonderful book' THE TIMES 'Perfect' NEW YORK TIMES 'A modern classic' DAILY MIRROR 'You'd be hard pressed to find a sharper, sweeter romantic comedy' INDEPENDENT 'Big, absorbing, smart, fantastically readable' NICK HORNBY TWENTY YEARS, TWO PEOPLE, ONE DAY 15th July 1988. Emma and Dexter meet for the first time on the night of their graduation. Tomorrow they must go their separate ways. So where will they be on this one day next year? And the year after that? And every year that follows? ONE OF BRITAIN'S MOST ACCLAIMED WRITERS 'One of the most astute chroniclers of England as it is now' FINANCIAL TIMES 'An uncanny ability to make us laugh out loud, but also care passionately about his characters' DAILY TELEGRAPH 'Nicholls writes with such tender precision about love' THE TIMES 'No one else writes novels that are both relatable and revelatory in the way he does' EVENING STANDARD 'Genuinely brilliant' NEW STATESMAN","Image_Url":"http:\/\/books.google.com\/books\/content?id=4y4eVOPOhIIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"A Thousand Splendid Suns by Khaled Hosseini (Book Analysis)","Author":"Bright Summaries","Description":"Unlock the more straightforward side of A Thousand Splendid Suns with this concise and insightful summary and analysis! This engaging summary presents an analysis of A Thousand Splendid Suns by Khaled Hosseini, a story of love, friendship and war in modern Afghanistan. It traces the bond that develops between Mariam and Laila, the first and second wives of a violent, abusive man. Despite their very different upbringings as a result of their country’s constantly changing political situation and the fact that Mariam initially feels that Laila is “stealing” her husband, the two women gradually become so close that they are like mother and daughter, and they will go to any lengths to protect each other. A Thousand Splendid Suns is Khaled Hosseini’s second novel, following on from his 2003 bestseller The Kite Runner. Find out everything you need to know about A Thousand Splendid Suns in a fraction of the time! This in-depth and informative reading guide brings you: • A complete plot summary • Character studies • Key themes and symbols • Questions for further reflection Why choose BrightSummaries.com? Available in print and digital format, our publications are designed to accompany you on your reading journey. The clear and concise style makes for easy understanding, providing the perfect opportunity to improve your literary knowledge in no time. See the very best of literature in a whole new light with BrightSummaries.com!","Image_Url":"http:\/\/books.google.com\/books\/content?id=Ha2PDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Girl Who Kicked the Hornets' Nest","Author":"Stieg Larsson","Description":"THE GIRL WITH THE DRAGON TATTOO RETURNS The iconic character who has captivated 100 million readers worldwide. \"Not just the extraordinary conclusion to the trilogy, but a work that contains its own fully-rounded plot . . . Brilliant\" Val Mcdermid Lisbeth Salander is a threat to national security. Since she was thirteen, shady government forces have conspired to keep her quiet. Prone to violence, deemed mentally disturbed, she has had her freedom removed and her every movement watched. Yet still, she is an unstoppable force for justice. Salander has a bullet in her head. She is wanted for murder. She knows that the secrets and corruption at the heart of her country's government go right to the top. And she won't take it lying down . . . \"Some novels claim to be page-turners, this trilogy is the real deal\" Financial Times \"This is a grown-up novel for grown-up readers, who want something more than a quick fix and a car chase . . . A publishing phenomenon all over the world\" Kate Mosse","Image_Url":"http:\/\/books.google.com\/books\/content?id=0F1hBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Time Traveler's Wife","Author":"Audrey Niffenegger","Description":"A most untraditional love story, this is the celebrated tale of Henry DeTamble, a dashing, adventuresome librarian who inadvertently travels through time, and Clare Abshire, an artist whose life takes a natural sequential course. Henry and Clare’s passionate affair endures across a sea of time and captures them in an impossibly romantic trap that tests the strength of fate and basks in the bonds of love. “Niffenegger’s inventive and poignant writing is well worth a trip” (Entertainment Weekly).","Image_Url":"http:\/\/books.google.com\/books\/content?id=iaMsEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Atonement","Author":"Ian McEwan","Description":"NATIONAL BESTSELLER • A symphonic novel of love and war, childhood and class, guilt and forgiveness that provides all the satisfaction of a brilliant narrative and the provocation we have come to expect from the acclaimed Booker Prize–winning, internationally bestselling author. One of the New York Times’s 100 Best Books of the 21st Century • A Kirkus Reviews Best Fiction Book of the Century “A beautiful and majestic fictional panorama.” —John Updike, The New Yorker On a hot summer day in 1935, thirteen-year-old Briony Tallis witnesses a moment’s flirtation between her older sister, Cecilia, and Robbie Turner, the son of a servant and Cecilia’s childhood friend. But Briony’s incomplete grasp of adult motives—together with her precocious literary gifts—brings about a crime that will change all their lives. As it follows that crime’s repercussions through the chaos and carnage of World War II and into the close of the twentieth century, Atonement engages the reader on every conceivable level, with an ease and authority that mark it as a genuine masterpiece.","Image_Url":"http:\/\/books.google.com\/books\/content?id=pX6lBs7Q0MEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Bridget Jones's Diary","Author":"Helen Fielding","Description":"Chronicles a year in the life of Bridget Jones, a single, thirtysomething woman on a perpetual quest for self-improvement, as she struggles to cope with relationships, weight control, and the other baffling complexities of modern life.","Image_Url":"http:\/\/books.google.com\/books\/content?id=kvZh8osJz3MC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The World According to Clarkson","Author":"Jeremy Clarkson","Description":"Jeremy Clarkson, shares his opinions on just about everything in The World According to Clarkson. Jeremy Clarkson has seen rather more of the world than most. He has, as they say, been around a bit. And as a result, he's got one or two things to tell us about how it all works - and being Jeremy Clarkson he's not about to voice them quietly, humbly and without great dollops of humour. In The World According to Clarkson, he reveals why it is that: • Too much science is bad for our health • '70s rock music is nothing to be ashamed of • Hunting foxes while drunk and wearing night-sights is neither big nor clever • We must work harder to get rid of cricket • He liked the Germans (well, sometimes) With a strong dose of common sense that is rarely, if ever, found inside the M25, Clarkson hilariously attacks the pompous, the ridiculous, the absurd and the downright idiotic, whilst also celebrating the eccentric, the clever and the sheer bloody brilliant. Less a manifesto for living and more a road map to modern life, The World According to Clarkson is the funniest book you'll read this year. Don't leave home without it. The World According to Clarkson is a hilarious collection of Jeremy's Sunday Times columns and the first in his The World According to Clarkson series which also includes And Another Thing . . . , For Crying Out Loud! and How Hard Can It Be? Praise for Jeremy Clarkson: 'Brilliant . . . laugh-out-loud' Daily Telegraph 'Outrageously funny . . . will have you in stitches' Time Out Number-one bestseller and presenter of the hugely popular Top Gear, Jeremy Clarkson writes on cars, current affairs and anything else that annoys him in his sharp and funny collections. Born To Be Riled, Clarkson On Cars, Don't Stop Me Now, Driven To Distraction, Round the Bend, Motorworld, and I Know You Got Soul are also available as Penguin paperbacks; the Penguin App iClarkson: The Book of Carscan be downloaded on the App Store.","Image_Url":"http:\/\/books.google.com\/books\/content?id=KBpq_gf4Va8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Captain Corelli's Mandolin","Author":"","Description":"No description available.","Image_Url":"http:\/\/books.google.com\/books\/content?id=7-ksEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Sound of Laughter","Author":"Peter Kay","Description":"Peter Kay's unerring gift for observing the absurdities and eccentricities of family life has earned himself a widespread, everyman appeal. These vivid observations coupled with a kind of nostalgia that never fails to grab his audience's shared understanding, have earned him comparisons with Alan Bennett and Ronnie Barker. In his award winning TV series' he creates worlds populated by degenerate, bitter, useless, endearing and always recognisable characters which have attracted a huge and loyal following. In many ways he's an old fashioned kind of comedian and the scope and enormity of his fanbase reflects this. He doesn't tell jokes about politics or sex, but rather rejoices in the far funnier areas of life: elderly relatives and answering machines, dads dancing badly at weddings, garlic bread and cheesecake, your mum's HRT... His autobiography is full of this kind of humour and nostalgia, beginning with Kay's first ever driving lesson, taking him back through his Bolton childhood, the numerous jobs he held after school and leading up until the time he passed his driving test and found fame.","Image_Url":"http:\/\/books.google.com\/books\/content?id=L-4KWVoX7skC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Life of Pi","Author":"Yann Martel","Description":"No description available.","Image_Url":"http:\/\/books.google.com\/books\/content?id=gTycDAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Billy Connolly Live","Author":"Billy Connolly","Description":"No description available.","Image_Url":""}}
{"model":"core.Books_seller","fields":{"Title":"A Child Called It","Author":"Dave Pelzer","Description":"A harrowing and inspiring true story of a young boy's abusive childhood, from international bestseller Dave Pelzer. 'A story where love, kindness, patience and endurance triumph' Daily Mail ***** Brutally beaten and starved by his emotionally unstable and alcoholic mother, Dave became a slave; he was no longer a boy, but an 'it'. His bed was an old army cot in the basement, his clothes torn and unwashed, and when he was allowed the luxury of food it was scraps from the dog's bowl. The outside world knew nothing of the nightmare played out behind closed doors. But throughout it all, Dave kept alive dreams of finding a family to love him. A Child Called 'It' shares the emotional story of the early years of his life, detailing the horrors of child abuse and the steadfast determination of one child to survive. It is the first book in the My Story trilogy. 'Heartfelt... cannot fail to move you' Heat","Image_Url":"http:\/\/books.google.com\/books\/content?id=iEeJX0-a1bQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Gruffalo's Child","Author":"Julia Donaldson","Description":"The Gruffalo's Child goes out to find the Big Bad Mouse she has heard so much about.","Image_Url":"http:\/\/books.google.com\/books\/content?id=EPpZAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Angela's Ashes","Author":"Frank McCourt","Description":"No description available.","Image_Url":""}}
{"model":"core.Books_seller","fields":{"Title":"Birdsong","Author":"Sebastian Faulks","Description":"#1 INTERNATIONAL BESTSELLER • A mesmerising story of love and war spanning three generations and the unimaginable gulf between the First World War and the 1990s In this \"overpowering and beautiful novel\" (The New Yorker), the young Englishman Stephen Wraysford passes through a tempestuous love affair with Isabelle Azaire in France and enters the dark, surreal world beneath the trenches of No Man's Land. Sebastian Faulks creates a world of fiction that is as tragic as A Farewell to Arms and as sensuous as The English Patient, crafted from the ruins of war and the indestructibility of love.","Image_Url":"http:\/\/books.google.com\/books\/content?id=bM0ZSUKuu6sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Northern Lights: His Dark Materials 1","Author":"Philip Pullman","Description":"Now a major BBC series. ‘Without this child, we shall all die.’ Lyra Belacqua lives half-wild and carefree among the scholars of Jordan College, with her daemon, Pantalaimon, always by her side. But the arrival of her fearsome uncle, Lord Asriel, draws her to the heart of a terrible struggle – a struggle born of stolen children, witch clans and armoured bears. As she hurtles towards danger in the cold far North, Lyra never suspects the shocking truth: she alone is destined to win, or to lose, the biggest battle imaginable.","Image_Url":"http:\/\/books.google.com\/books\/content?id=2h9rBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"La Batalla del Laberinto \/ The Battle of the Labyrinth","Author":"Rick Riordan","Description":"Continúan las aventuras de Percy Jackson en esta cuarta entrega de la serie «Percy Jackson y los dioses del Olimpo». Una serie trepidante que ha ocupado las listas de los libros más vendidos del The New York Times y Publishers Weekly y que ha llegado a la gran pantalla a cargo de Chris Columbus, director de las dos primeras entregas de «Harry Potter». A punto de comenzar primero de secundaria, Percy Jackson no espera emociones fuertes, sino más bien un aburrimiento soporífero. Pero cuando en la nueva escuela se presenta una vieja amiga, seguida de un par de animadoras diabólicas, los acontecimientos se precipitan y todo empieza a ir de mal en peor. Cronos, el malvado señor de los titanes, amenaza con destruir el Campamento Mestizo, donde se refugian los jóvenes semidioses. Para evitarlo, Percy y sus amigos deben emprender una arriesgada búsqueda a través del laberinto, un mundo subterráneo plagado de trampas temibles y criaturas perversas, concebido para acabar con quienes se atrevan a profanarlo. ENGLISH DESCRIPTION Percy Jackson isn't expecting freshman orientation to be any fun. But when a mysterious mortal acquaintance appears on campus, followed by demon cheerleaders, things quickly move from bad to diabolical. In this latest installment of the blockbuster series, time is running out as war between the Olympians and the evil Titan lord Kronos draws near. Even the safe haven of Camp Half-Blood grows more vulnerable by the minute as Kronos's army prepares to invade its once impenetrable borders. To stop them, Percy and his demigod friends must set out on a quest through the Labyrinth-a sprawling underground world with stunning surprises at every turn. Full of humor and heart-pounding action, this fourth book promises to be their most thrilling adventure yet.","Image_Url":"http:\/\/books.google.com\/books\/content?id=W25i0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Harry Potter and the Half-Blood Prince","Author":"J. K. Rowling","Description":"Sixth-year Hogwarts student Harry Potter gains valuable insights into the boy Voldemort once was, even as his own world is transformed by maturing friendships, schoolwork assistance from an unexpected source, and devastating losses.","Image_Url":"http:\/\/books.google.com\/books\/content?id=1YwtPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"How to Help the Poor","Author":"Annie Fields","Description":"How to Help the Poor is an unchanged, high-quality reprint of the original edition of 1885. Hansebooks is editor of the literature on different topic areas such as research and science, travel and expeditions, cooking and nutrition, medicine, and other genres. As a publisher we focus on the preservation of historical literature. Many works of historical writers and scientists are available today as antiques only. Hansebooks newly publishes these books and contributes to the preservation of literature which has become rare and historical knowledge for the future.","Image_Url":"http:\/\/books.google.com\/books\/content?id=NYkatAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Man and Boy","Author":"Tony Parsons","Description":"The 20th anniversary edition of the multi-million copy bestseller! ‘Wistful, touching and funny’ Mail on Sunday ‘Hilarious and tear-jerking in turns’ Express ‘A sharp, witty and wise book straight from the heart’ Daily Mail","Image_Url":"http:\/\/books.google.com\/books\/content?id=OUzesV-H498C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Memoirs of a Geisha","Author":"Arthur Golden","Description":"A literary sensation and runaway bestseller, this brilliant debut novel tells with seamless authenticity and exquisite lyricism the true confessions of one of Japan's most celebrated geisha. Nominated as one of America’s best-loved novels by PBS’s The Great American Read Speaking to us with the wisdom of age and in a voice at once haunting and startlingly immediate, Nitta Sayuri tells the story of her life as a geisha. It begins in a poor fishing village in 1929, when, as a nine-year-old girl with unusual blue-gray eyes, she is taken from her home and sold into slavery to a renowned geisha house. We witness her transformation as she learns the rigorous arts of the geisha: dance and music; wearing kimono, elaborate makeup, and hair; pouring sake to reveal just a touch of inner wrist; competing with a jealous rival for men's solicitude and the money that goes with it. In Memoirs of a Geisha, we enter a world where appearances are paramount; where a girl's virginity is auctioned to the highest bidder; where women are trained to beguile the most powerful men; and where love is scorned as illusion. It is a unique and triumphant work of fiction—at once romantic, erotic, suspenseful—and completely unforgettable.","Image_Url":"http:\/\/books.google.com\/books\/content?id=SOM54qQ6BgkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The No. 1 Ladies' Detective Agency","Author":"Alexander McCall Smith","Description":"The first book in the multi-million copy bestselling No. 1 Ladies' Detective Agency series The one where it all begins Mma Ramotswe is the proud proprietor of the finest ladies' detective agency in all Botswana (also the only one). She spends her time, with a cup of redbush tea beneath the acacia tree, waiting for clients. When they come along, whether it is to enquire after a missing spouse or check the identity of a long-lost father, it is not The Principles of Private Detection that helps her to solve cases but old-fashioned common sense and a warm-hearted understanding of the fallibility of human nature - especially that of men. 'Among the greatest comfort-reads of all time' Sunday Times 'Jolly and exhilarating' Sunday Telegraph 'The Miss Marple of Botswana' New York Times Book Review 'A publishing phenomenon' Guardian","Image_Url":"http:\/\/books.google.com\/books\/content?id=S-t-icCTcIkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Island (The Thriller Collection, Book 6)","Author":"Sarah Goodwin","Description":"FYRE FESTIVAL meets ONE OF THE GIRLS in this psychological thriller with twists you'll never see coming.","Image_Url":"http:\/\/books.google.com\/books\/content?id=ZDzuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"P.S. I Love You","Author":"Frances Davies","Description":"P.S. I Love You by Frances Davies released on Sep 24, 1988 is available now for purchase.","Image_Url":"http:\/\/books.google.com\/books\/content?id=b259k9wqiusC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"You Are What You Eat","Author":"Gillian McKeith","Description":"THE ORIGINAL GUIDE TO HEALTHY EATING AND MULTI-MILLION COPY BESTSELLER Discover the very best health and lifestyle secrets behind the legendary hit TV show You Are What You Eat, and get ready to meet the new you . . . Tried, tested and trusted for over fifteen years, You Are What You Eat is the essential companion for changing your relationship with food forever. With the expert advice of Dr Gillian McKeith, you will quickly learn how to . . . · Find out what your diet is doing to you using the food IQ test · Banish cravings and mood swings · Discover how small changes can make a big difference · Eat more . . . Not less · Repair your relationship with food · Feel nourished and satisfied every day Follow Gillian's simple advice and you'll look and feel fantastic - just see for yourself! 'It's a tough-love approach and the results are undeniably fantastic' Closer","Image_Url":"http:\/\/books.google.com\/books\/content?id=FpMaZVnseXwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Shadow Chase: Book two of The Wind's Children","Author":"Emma Miles","Description":"After his quest to seek the Dragons Elenion, Prince of the Wind Elves, made the decision to take his people to war; but the truth is deceiving and what the seers see only a small glimpse of what is to come. Tobias, newly crowned, must find his feet as King of the Odaen in the heat of battle and Artheiwyn faces the hardest struggle of all - against herself.","Image_Url":"http:\/\/books.google.com\/books\/content?id=U-ewCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Tales of Beedle the Bard","Author":"J. K. Rowling","Description":"For use in schools and libraries only. Offering the trademark wit and imagination familiar to Rowling's legions of readers--as well as Aesop's wisdom and the occasional darkness of the Brothers Grimm--each of these five tales reveals a lesson befitting children and parents alike.","Image_Url":"http:\/\/books.google.com\/books\/content?id=gSBavgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Mastering The Art of The Broker","Author":"Cameron Todd","Description":"This book is a must read for anyone who is interested in learning the details of what it takes to learn this luxury 600 billion dollar a year industry. By walking through this book step by step you will learn how to be an agent or broker and start living your preferred lifestyles now!","Image_Url":"http:\/\/books.google.com\/books\/content?id=1_NkzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Dr Atkins New Diet Revolution","Author":"Robert C Atkins","Description":"Follow the Dr Atkins' Diet and forget counting calories. Watch the fat melt away as a healthier and firmer body emerges. Enjoy more energy as well as freedom from a range of ailments from diabetes to heart disease. Essentially a low carbohydrate plan, the Atkins' Diet boosts your metabolic rate and once your metabolism is changed, your body adjusts to a new way of burning fat. Dieting can work, and with this medically proven regime you can lose weight without reducing - or counting - calories. On the Atkins' Diet you can: -Eat luxuriously and feel completely satisfied -Experience the metabolic boost the Atkins' Diet provides -Use a maintenance diet that will ensure you never become fat again -Enjoy mouth-watering, gourmet recipes In this edition the world's number one diet expert has updated his proven program to include: new low-carb recipes for breakfast, lunch and dinner; brand new case studies and the very latest scientific research.","Image_Url":"http:\/\/books.google.com\/books\/content?id=cadRcfzIdvIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"His Dark Materials: The Subtle Knife","Author":"Turtleback Books Publishing, Limited","Description":"No description available.","Image_Url":"http:\/\/books.google.com\/books\/content?id=NXfAzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Eats, Shoots & Leaves","Author":"Lynne Truss","Description":"At front and back of book: Punctuation repair kit [stickers].","Image_Url":"http:\/\/books.google.com\/books\/content?id=_-BgAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Delia's how to cook..","Author":"Delia Smith","Description":"No description available.","Image_Url":"http:\/\/books.google.com\/books\/content?id=sarMuQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Шоколад \/ Chocolat","Author":"Джоанн Харрис","Description":"Сонное спокойствие маленького французского городка нарушено приездом молодой женщины Вианн и ее дочери. Они появились вместе с шумным и ярким карнавальным шествием, а когда карнавал закончился, его светлая радость осталась в глазах Вианн, открывшей здесь свой шоколадный магазин. Каким-то чудесным образом она узнает о сокровенных желаниях жителей городка и предлагает каждому именно такое шоколадное лакомство, которое заставляет его вновь почувствовать вкус к жизни.«Шоколад» – это история о доброте и терпимости, о противостоянии невинных соблазнов и закоснелой праведности. Одноименный голливудский фильм режиссера Лассе Халлстрёма (с Жюльетт Бинош, Джонни Деппом и Джуди Денч в главных ролях) был номинирован на «Оскар» в пяти категориях и на «Золотой глобус» – в четырех.В формате PDF A4 сохранен издательский макет книги.","Image_Url":"http:\/\/books.google.com\/books\/content?id=9z0jEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Boy in the Striped Pyjamas","Author":"John Boyne","Description":"Discover an extraordinary tale of innocence, friendship and the horrors of war. 'Some things are just sitting there, minding their own business, waiting to be discovered. Like America. And other things are probably better off left alone' Nine-year-old Bruno has a lot of things on his mind. Who is the 'Fury'? Why did he make them leave their nice home in Berlin to go to 'Out-With' ? And who are all the sad people in striped pyjamas on the other side of the fence? The grown-ups won't explain so Bruno decides there is only one thing for it - he will have to explore this place alone. What he discovers is a new friend. A boy with the very same birthday. A boy in striped pyjamas. But why can't they ever play together? ‘A small wonder of a book’ Guardian BACKSTORY: Read an interview with the author JOHN BOYNE and learn all about the Second World War in Germany.","Image_Url":"http:\/\/books.google.com\/books\/content?id=yNMdhHubFK0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"My Sister's Keeper","Author":"Jodi Picoult","Description":"A thirteen-year-old girl who was conceived as a bone marrow match for her older sister questions her identity and challenges her parents for the right to make her own decisions.","Image_Url":"http:\/\/books.google.com\/books\/content?id=LR8aOkXEwUcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Amber Spyglass: His Dark Materials","Author":"Turtleback Books Publishing, Limited","Description":"No description available.","Image_Url":"http:\/\/books.google.com\/books\/content?id=C5e_zQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"To Kill a Mockingbird","Author":"Harper Lee","Description":"Harper Lee's classic novel of a lawyer in the Deep South defending a black man charged with the rape of a white girl. One of the best-loved stories of all time, To Kill a Mockingbird has earned many distinctions since its original publication in 1960. It won the Pulitzer Prize, has been translated into more than forty languages, sold more than thirty million copies worldwide, and been made into an enormously popular movie. Most recently, librarians across the country gave the book the highest of honors by voting it the best novel of the twentieth century.","Image_Url":"http:\/\/books.google.com\/books\/content?id=DRagKAMw8AcC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Men Are From Mars Women Are From Venus International Edition","Author":"John Gray","Description":"Popular marriage counselor and seminar leader John Gray provides a unique, practical, and proven way for men and women to communicate and relate better by acknowledging the differences between them. Copyright © Libri GmbH. All rights reserved.","Image_Url":"http:\/\/books.google.com\/books\/content?id=rSeCyV56hg8C&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Dear Fatty","Author":"Dawn French","Description":"A SUNDAY TIMES NUMBER ONE BESTSELLER ___________________________ The hilarious and heartwarming memoir from one of Britain's best-loved comedians and Women's Prize longlisted author, Dawn French. Dawn French is one of the greatest comedians of our time with a career that has spanned nearly four decades. Loved for her irreverent humour, Dawn has achieved massive mainstream success while continuing to push boundaries and challenge stereotypes. Here, she describes the journey that would eventually establish her as a perhaps unlikely, but nevertheless genuine, national treasure. As part of the much loved duo French and Saunders, Dawn helped create a repertoire of brilliantly observed characters, impersonating everything from Madonna and Harry Potter to The Exorcist. Dawn's iconic role in the Vicar of Dibley showcased not only her talent but also her ability to take a controversial and topical issue and make it mainstream - and very funny. From her early years as an RAF child and her flat-sharing antics with Jennifer Saunders, to her outspoken views on sizism and her marriage to Lenny Henry, Dear Fatty chronicles the extraordinary and hilarious rise of a complex, dynamic and unstoppable woman.","Image_Url":"http:\/\/books.google.com\/books\/content?id=LU9_ijkuo7IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"A Short History of Tractors in Ukrainian","Author":"Marina Lewycka","Description":"THE AWARD-WINNING, MILLION-COPY BESTSELLER A hilarious, lively, moving and compassionate debut about one Ukrainian-British family's tumultuous relationship and the history they never knew. 'Delightful, funny, touching' Spectator ***** \"As Romeo and Juliet found to their cost, marriage is never just about two people falling in love, it is about families.\" Sisters Vera and Nadezhda must aside a lifetime of feuding to save their widowed, tractor-obsessed Ukrainian father from the voluptuous, wealth-obsessed Valentina. With her proclivity for green satin underwear and boil-in-the-bag cuisine, she outmanoeuvres the sisters at every turn. But their campaign to oust Valentina unearths family secrets, uncovers fifty years of European and Ukrainian history, and sends them back to roots they'd much rather forget . . . ***** 'Hugely enjoyable . . . yields a golden harvest of family truths' Daily Telegraph 'Captures the peculiar flavour of Eastern European immigrant life . . . a very rich mixture indeed' Daily Express 'It's rare to find a first novel that gets so much right . . . Lewycka is a seriously talented comic writer' Time Out","Image_Url":"http:\/\/books.google.com\/books\/content?id=M-reDQfyq6EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Hannibal Rising","Author":"Thomas Harris","Description":"He is one of the most haunting characters in all of literature. At last the evolution of his evil is revealed. Hannibal Lecter emerges from the nightmare of the Eastern Front, a boy in the snow, mute, with a chain around his neck. He seems utterly alone, but he has brought his demons with him. Hannibal’s uncle, a noted painter, finds him in a Soviet orphanage and brings him to France, where Hannibal will live with his uncle and his uncle’s beautiful and exotic wife, Lady Murasaki. Lady Murasaki helps Hannibal to heal. With her help he flourishes, becoming the youngest person ever admitted to medical school in France. But Hannibal’s demons visit him and torment him. When he is old enough, he visits them in turn. He discovers he has gifts beyond the academic, and in that epiphany, Hannibal Lecter becomes death’s prodigy.","Image_Url":"http:\/\/books.google.com\/books\/content?id=kYY7bge02SoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Lord of the Rings: The Fellowship of the Ring, The Two Towers, The Return of the King","Author":"J. R. R. Tolkien","Description":"All three parts of the epic masterpiece The Lord of the Rings – The Fellowship of the Ring, The Two Towers & The Return of the King – available as one download, featuring the definitive edition of the text, hyperlinked footnotes and page references, and 3 maps including a detailed map of Middle-earth.","Image_Url":"http:\/\/books.google.com\/books\/content?id=FKziXsnqLTEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Stupid White Men-- and Other Sorry Excuses for the State of the Nation!","Author":"Michael Moore","Description":"Rember when everything was looking up? When the government was running at a surplus pollution was disappearing peace was breaking out in the middle East and Northern Ireland and the Bridge to the Twenty-First century was strung with Internet cable and paved with 401 (k) gold? Well, so much for the future. Michael Moore the award winning povocateur behind Roger & Me and the best seller Downsize This! now returns to size up the new century and that big, ugly special interest group that's laying waste to the world as we know it: stupid white men. Among the targets of Mike's Manifesto on Malfeasance and mediocrity are the Bush family Junta, Bll Clinton the Idiot Nation and Corporate American.","Image_Url":"http:\/\/books.google.com\/books\/content?id=Ah3iDWqekO4C&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Interpretation of Murder","Author":"Jed Rubenfeld","Description":"THE INTERPRETATION OF MURDER is an inventive tour de force inspired by Sigmund Freud's 1909 visit to America, accompanied by protégé and rival Carl Jung. When a wealthy young debutante is discovered bound, whipped and strangled in a luxurious apartment overlooking the city, and another society beauty narrowly escapes the same fate, the mayor of New York calls upon Freud to use his revolutionary new ideas to help the surviving victim recover her memory of the attack, and solve the crime. But nothing about the attacks - or about the surviving victim, Nora - is quite as it seems. And there are those in very high places determined to stop the truth coming out, and Freud's startling theories taking root on American soil.","Image_Url":"http:\/\/books.google.com\/books\/content?id=52HMFETR0dYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Sharon Osbourne Extreme","Author":"Sharon Osbourne","Description":"Sharon Osbourne reveals the truth behind the headlines in her characteristically frank, intimate and articulate memoir-from her childhood as the daughter of Don Arden, to managing and marrying Ozzy Osbourne, to her rising fame on shows such as The Osbournes and The X Factor. A devoted wife and mother, businesswoman, TV star and award-winning producer, Sharon Osbourne has, in her own words, \"lived fifty lives in fifty years\". Her childhood with her father, the notorious rock manager Don Arden, was an unruly mix of glamour and violence. In her late 20s, Sharon finally made the painful decision to break with her family. Always irrepressible, Sharon flourished, creating a loving family of her own while becoming a legendary manager and rock band promoter. In rock star Ozzy Osbourne, Sharon found her soul mate, yet Ozzy's drug and drink-fueled excesses-which culminated in his attempt to strangle her-made their marriage a white-knuckle ride from the start. Only her devotion to their three children gave her the will to survive. From the tremendous highs of the hit show The Osbournes to the devastating lows of Ozzy's near-fatal quad-bike accident and her own bout with colon cancer, Sharon's tenacity, honesty, and humor have triumphed again and again.","Image_Url":"http:\/\/books.google.com\/books\/content?id=1c83AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"THE ALCHEMIST","Author":"NARAYAN CHANGDER","Description":"If you need a free PDF practice set of this book for your studies, feel free to reach out to me at cbsenet4u@gmail.com, and I'll send you a copy! THE ALCHEMIST MCQ (MULTIPLE CHOICE QUESTIONS) SERVES AS A VALUABLE RESOURCE FOR INDIVIDUALS AIMING TO DEEPEN THEIR UNDERSTANDING OF VARIOUS COMPETITIVE EXAMS, CLASS TESTS, QUIZ COMPETITIONS, AND SIMILAR ASSESSMENTS. WITH ITS EXTENSIVE COLLECTION OF MCQS, THIS BOOK EMPOWERS YOU TO ASSESS YOUR GRASP OF THE SUBJECT MATTER AND YOUR PROFICIENCY LEVEL. BY ENGAGING WITH THESE MULTIPLE-CHOICE QUESTIONS, YOU CAN IMPROVE YOUR KNOWLEDGE OF THE SUBJECT, IDENTIFY AREAS FOR IMPROVEMENT, AND LAY A SOLID FOUNDATION. DIVE INTO THE ALCHEMIST MCQ TO EXPAND YOUR THE ALCHEMIST KNOWLEDGE AND EXCEL IN QUIZ COMPETITIONS, ACADEMIC STUDIES, OR PROFESSIONAL ENDEAVORS. THE ANSWERS TO THE QUESTIONS ARE PROVIDED AT THE END OF EACH PAGE, MAKING IT EASY FOR PARTICIPANTS TO VERIFY THEIR ANSWERS AND PREPARE EFFECTIVELY.","Image_Url":"http:\/\/books.google.com\/books\/content?id=XTkXEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"At My Mother's Knee...And Other Low Joints","Author":"Paul O'Grady","Description":"THE MILLION COPY BESTSELLER 'Warmly funny, dry and mischievous . . . Genuine and brilliant.' Daily Mail Paul O'Grady is one of Britain's very best loved entertainers. He is known and adored by millions, whether as the creator of the acid-tongued Blonde Bombsite, Lily Savage, the presenter of the fantastically successful, award-winning Paul O'Grady Show on Channel 4 or the massive hit ITV show, For the Love of Dogs. Now, in his own unique voice, Paul O'Grady tells story of his early life in Irish Catholic Birkenhead that started him on the long and winding road from mischievous altar boy to national treasure. It is a brilliantly evoked, hilarious and often moving tale of gossip in the back yard, bragging in the corner shop and slanging matches on the front doorstep, populated by larger-than-life characters with hearts of gold and tongues as sharp as razors. At My Mother's Knee features an unforgettable cast of rogues, rascals, lovers, fighters, saints and sinners - and one iconic bus conductress. It's a book which really does have something for everyone and which reminds us that, when all's said and done, there's a bit of savage in all of us... Readers love At My Mother's Knee: 'I laughed, I cried, I couldn't put it down and the characters really just jumped out of the page.' ***** 'Candid, heart warming and also hilarious.' ***** 'Wonderfully written, laugh out loud funny and poignant by turns.' *****","Image_Url":"http:\/\/books.google.com\/books\/content?id=PSVyJetkFmsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Notes From A Small Island","Author":"Bill Bryson","Description":"In 1995, before leaving his much-loved home in North Yorkshire to move back to the States for a few years with his family, Bill Bryson insisted on taking one last trip around Britain, a sort of valedictory tour of the green and kindly island that had so long been his home. His aim was to take stock of the nation's public face and private parts (as it were), and to analyse what precisely it was he loved so much about a country that had produced Marmite; a military hero whose dying wish was to be kissed by a fellow named Hardy; place names like Farleigh Wallop, Titsey and Shellow Bowells; people who said 'Mustn't grumble', and ‘Ooh lovely’ at the sight of a cup of tea and a plate of biscuits; and Gardeners' Question Time. Notes from a Small Island was a huge number-one bestseller when it was first published, and has become the nation's most loved book about Britain, going on to sell over two million copies.","Image_Url":"http:\/\/books.google.com\/books\/content?id=Ba02tF_3FRQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Return of the Naked Chef","Author":"Jamie Oliver","Description":"The Return of The Naked Chef is jam-packed with more proper food you'll love to cook. Filled with all the techniques and tips you'll need to become a pro in the kitchen, The Return of the Naked Chef contains a whole range of new, simple, but exciting recipes which anyone can make, delivered with boundless enthusiasm. These recipes will become firm family favourites in no time, and Jamie also includes kitchen tips & tricks to get you started. Delicious recipes include: · SPAGHETTI with ANCHOVIES, DRIED CHILLI and PANGRATTATO · Fantastic FISH PIE · Baked Jerusalem ARTICHOKES, BREADCRUMBS, THYME and LEMON · Tray baked PORK CHOPS with HERBY POTATOES, PARSNIPS, PEARS and MINTED BREAD SAUCE · CHOCOLATE POTS This book is full of recipes for every meal of the day, with chapters on: Potty about Herbs, Morning Glory, Tapas, Munchies & Snacks, Simple Salads and Dressings, Soups and Broths, Pasta & Risotto, Fish & Shellfish, Meat Poultry & Game, Vegetables, Bread, Desserts, Bevvies, and Stocks, Sauces, Bits, Bobs, This, That & The Other! 'Jamie Oliver goes from strength to strength ... the main attraction is that he does not seem to want to be, or know that he might be, a star: the food is what matters' The Times ____________ Celebrating the 20th anniversary of The Naked Chef Penguin are re-releasing Jamie's first five cookbooks as beautiful Hardback Anniversary Editions - an essential for every kitchen. The Naked Chef The Return of the Naked Chef Happy Days with the Naked Chef Jamie's Kitchen Jamie's Dinners '20 years on . . . Does it stand the test of my kitchen? The answer is a resounding yes. Jamie's genius is in creating maximum flavour from quick, easy-to-follow recipes . . . It hasn't dated at all' Daily Telegraph on The Naked Chef","Image_Url":"http:\/\/books.google.com\/books\/content?id=ngaFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Bridget Jones: The Edge of Reason","Author":"Helen Fielding","Description":"The Number One Bestseller from Helen Fielding The Wilderness Years are over! But for how long? Bridget's second diary, Bridget Jones: The Edge of Reason takes us through a year that begins with man-of-her-dreams Mark Darcy (who never does the washing up) and lurches onwards through a sea of self-help books and lunatic advice from her mad friends. Struggling with the challenges of a boyfriend-stealing beauty, an eight-foot hole in the wall and a builder obsessed with large reservoir fish, Bridget decides it's time for a spiritual epiphany. And so she departs Notting Hill for the sparkling shores of Thailand . . . Bridget is back. V.g.","Image_Url":"http:\/\/books.google.com\/books\/content?id=2JSgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Jamie's Italy","Author":"Jamie Oliver","Description":"In 'Jamie's Italy' Oliver travels around Italy paying homage to the classic dishes of each region and searching for new ideas to bring home. The result is a collection of Italian recipes, old and new, that will ensure Italy's influence reaches us all.","Image_Url":"http:\/\/books.google.com\/books\/content?id=fFsYAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"I Can Make You Thin","Author":"Paul McKenna, Ph.D.","Description":"Would you like to eat whatever you want and still lose weight? Would you like to feel really happy with your body? Are you unable to lose those last 10 pounds? Do you find it difficult to say no to second helpings? Do you get disheartened about your eating habits and your weight? Have you tried every diet and it made no difference long-term? Then this amazing system is for you! Welcome to a revolutionary new way to stop overeating, control cravings, and feel totally motivated to exercise. Paul McKenna has developed a breakthrough weight-loss system that re-patterns your thoughts, attitudes, and beliefs about yourself, your health, and food to help you easily take control of your diet and lose weight permanently. As you use Dr. McKenna’s unique book and audio system, the latest psychological techniques will automatically help you to start losing weight right away! You can use it again and again to make you feel happier about yourself as you go all the way to your ideal shape, size, and weight.","Image_Url":"http:\/\/books.google.com\/books\/content?id=KWD6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Thunder Down Under","Author":"Don Pendleton","Description":"OUTBACK SABOTAGE","Image_Url":"http:\/\/books.google.com\/books\/content?id=yutbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Summons","Author":"","Description":"No description available.","Image_Url":""}}
{"model":"core.Books_seller","fields":{"Title":"Small Island","Author":"Andrea Levy","Description":"It is 1948 in an England that is still shaken by war. At 21 Nevern Street, London, Queenie Bligh takes into her house lodgers who have recently arrived from Jamaica. She feels she has no choice. Her husband, Bernard, whom she married to escape her dreary upbringing on a farm in the Midlands, was posted to India with the RAF during the war, but when the conflict was over he did not return. What else could she do?\" \"Among her tenants are Gilbert and his new wife Hortense. Gilbert Joseph was one of the serveral thousand Jamaican men who joined the RAF to fight against Hitler. Returning to England after the war he finds himself treated very differently now that his is no longer in a blue uniform. It is desperation that makes him remember a wartime friendship with Queenie and knock at her door.\" \"Hortense shared Gilbert's dream of leaving Jamaica and coming to England to start a better life - that's why she married him. But when she at last joins her husband, she is shocked by London's shabbiness and horrified at the way the English live. Even Gilbert is not the man she thought he was.\" \"Queenie's neighbors do not approve of her choice of tenants, and neither would her husband, were he there. England may be recovering from a war but at 21 Nevern Street it has only just begun.","Image_Url":"http:\/\/books.google.com\/books\/content?id=Ts2ePwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Nigella Express","Author":"Nigella Lawson","Description":"Nigella Lawson and her style of cookery have earned a special place in our lives, symbolizing all that is best, most pleasurable, most hands-on and least fussy about good food. But that doesn’t mean she wants us to spend hours in the kitchen slaving over a hot stove. Featuring fabulous fast foods, ingenious short cuts, terrific time-saving ideas and easy, delicious meals, Nigella Express is her solution to eating well when time is short. Here are mouthwatering recipes, quick to prepare and easy to follow, that you can conjure up after a long day in the office or on a busy weekend. When time is precious, you can’t spend hours shopping or cooking, so you need to make life easier by being prepared. This is food you can make as you hit the kitchen running, with vital tips on how to keep your store cupboard stocked, and your fridge and freezer stacked. Not that the recipes are basic–though they are always simple–but it’s important to make every ingredient earn its place in a recipe. Minimize effort by maximizing taste. And here, too, is great food that can be prepared quickly but cooked slowly in the oven, leaving you time to have a bath or a drink, talk to friends or do homework with your children. It’s minimum stress for maximum enjoyment. This is a new generation of fast food–never basic, never dull, always do-able, quick and delicious. The Domestic Goddess is back and this time it’s instant.","Image_Url":"http:\/\/books.google.com\/books\/content?id=s9jYfzcLtQYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Brick Lane","Author":"","Description":"No description available.","Image_Url":""}}
{"model":"core.Books_seller","fields":{"Title":"The Memory Keeper's Daughter","Author":"Kim Edwards","Description":"The multi-million copy bestseller, Kim Edwards' The Memory Keeper's Daughter is a moving and poignant novel about grief, family and betrayal. Families have secrets they hide even from themselves... It should have been an ordinary birth, the start of an ordinary happy family. But the night Dr David Henry delivers his wife's twins is a night that will haunt five lives for ever. For though David's son is a healthy boy, his daughter has Down's syndrome. And, in a shocking act of betrayal whose consequences only time will reveal, he tells his wife their daughter died while secretly entrusting her care to a nurse. As grief quietly tears apart David's family, so a little girl must make her own way in the world as best she can. 'Crafted with language so lovely you have to reread the passages just to be captivated all over again . . . this is simply a beautiful book' Jodi Picoult 'I loved this riveting story with its intricate characters and beautiful language' Sue Monk Kidd, author of the best-selling, The Secret Life of Bees Kim Edwards is the author of the short-story collection The Secrets of the Fire King, which was an alternate for the 1998 PEN\/Hemingway Award, and has won the Whiting Award and the Nelson Algren Award. Her second novel, The Lake of Dreams, is available from Penguin. She is an assistant professor of English at the University of Kentucky.","Image_Url":"http:\/\/books.google.com\/books\/content?id=MsnkwPLcO3UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Room on the Broom","Author":"Julia Donaldson","Description":"This fun family read-aloud is the perfect way to start Halloween celebrations and an ideal gift book. A sweet story of quick wits, friendship, and inclusivity from the creators of The Gruffalo! The witch and her cat are happily flying through the sky on a broomstick when the wind picks up and blows away the witch's hat, then her bow, and then her wand! Luckily, three helpful animals find the missing items, and all they want in return is a ride on the broom. But is there room on the broom for so many friends? And when disaster strikes, will they be able to save the witch from a hungry dragon? Julia Donaldson and Axel Scheffler are the creators of many beloved picture books including The Gruffalo, The Gruffalo's Child, The Snail and the Whale, and The Spiffiest Giant in Town. \"A surefire read-aloud hit.\" -School Library Journal","Image_Url":"http:\/\/books.google.com\/books\/content?id=fASTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"What about The Boys?","Author":"Wayne Martino, Bob Meyenn","Description":"* How can teachers address the challenge of educating boys for life in the 21st century? * What aspects of schooling are particularly problematic for boys? * How do issues of class, race and sexuality impact upon boys educational experiences? This edited collection brings together leading researchers from Australia, United Kingdom and the United States to explore issues of boys, schooling and masculinities within the context of the current concern about the education of boys. The contributors draw on detailed empirical research to highlight some important issues that are not addressed in public debates about boys in the media. Chapter topics include international perspectives on debates about boys; teaching boys; programs for boys in schools; boys and risk taking; boys and discipline; boys and sexuality; Afro-American boys; indigenous boys in Australian schools; boys and reading; boys and maths; boys, dance and sport; boys and science; girls' talk about boys. The book will be important and compelling reading for all teachers concerned with the education of boys.","Image_Url":"http:\/\/books.google.com\/books\/content?id=P5JEBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"My Booky Wook","Author":"Russell Brand","Description":"Russell Brand grew up in Essex. His father left when he was three months old, he was bulimic at 12 and left school at 16 to study at the Italia Conti stage school. There, he began drinking heavily and taking drugs. He regularly visited prostitutes in Soho, began cutting himself, took drugs on stage during his stand-up shows, and even set himself on fire while on crack cocaine. He has been arrested 11 times and fired from 3 different jobs - including from XFM and MTV - and he claims to have slept with over 2,000 women. In 2003 Russell was told that he would be in prison, in a mental hospital or dead within six months unless he went in to rehab. He has now been clean for three years. In 2006 his presenting career took off, and he hosted the NME awards as well as his own MTV show, 1 Leicester Square, plus Big Brother's Big Mouth on Channel 4. His UK stand-up tour was sold out and his BBC Radio 6 show became a cult phenomenon, the second most popular podcast of the year after Ricky Gervais. He was awarded Time Out's Stand Up Comedian of the Year and won Best Newcomer at the British Comedy Awards. In 2007 Russell hosted both the Brit Awards and Comic Relief, and continued to front Big Brother's Big Mouth. His BBC2 radio podcast became the UK's most popular. Russell writes a weekly football column in the Guardian and is the patron of Focus 12, a charity helping people with alcohol and substance misuse. He also hosts a podcast, Under the Skin, in which he delves below the surface of modern society.","Image_Url":"http:\/\/books.google.com\/books\/content?id=H8dU8mGFHG4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The God Delusion","Author":"Richard Dawkins","Description":"THE FOUR MILLION COPY INTERNATIONAL BESTSELLER The brilliantly argued and impassioned classic polemic from the world’s best-known atheist. Sensationally incisive and perennially timely, this is required reading for everyone. ‘A resounding trumpet blast for truth’ Matt Ridley '[The God Delusion] deserves multiple readings; not just as an important work of science, but as a great work of literature’ Steven Weinberg, Nobel Laureate, Times Literary Supplement ‘If its merciless rationalism doesn’t enrage you at some point, you probably aren’t alive’ Julian Barnes ‘Entertaining, wildly informative, splendidly written’ Rod Liddle, Sunday Times 'There is not a dull page . . . a book that makes me want to cheer its clarity, intelligence and truth-telling’ Claire Tomalin ‘My favourite book of all time . . . a heroic and life-changing work’ Derren Brown ‘Spirited and exhilarating . . . Dawkins comes roaring forth in the full vigour of his powerful arguments’ Joan Bakewell, Guardian ‘At last, Richard Dawkins, one of the best non-fiction writers alive today, has assembled his thoughts on religion into a characteristically elegant book’ Steven Pinker ‘The world needs passionate rationalists unafraid to challenge long accepted beliefs. Richard Dawkins so stands out through the cutting intelligence of e God Delusion’ James D. Watson, Nobel Laureate and co-discoverer of DNA ---------- The God Delusion caused a sensation when it was published in 2006. Within weeks it became the most hotly debated topic, with Dawkins himself branded as either saint or sinner for presenting his hard-hitting, impassioned rebuttal of religion of all types. His argument could hardly be more topical. While Europe is becoming increasingly secularized, the rise of religious fundamentalism, whether in the Middle East or Middle America, is dramatically and dangerously dividing opinion around the world. In America, and elsewhere, a vigorous dispute between 'intelligent design' and Darwinism is seriously undermining and restricting the teaching of science. In many countries religious dogma from medieval times still serves to abuse basic human rights such as women's and gay rights. And all from a belief in a God whose existence lacks evidence of any kind. Dawkins attacks God in all his forms. He eviscerates the major arguments for religion and demonstrates the supreme improbability of a supreme being. He shows how religion fuels war, foments bigotry and abuses children. The God Delusion is a brilliantly argued, fascinating polemic: required reading for anyone interested in this most emotional and important subject.","Image_Url":"http:\/\/books.google.com\/books\/content?id=grccDzrTWLUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Beano Annual","Author":"D. C. Thomson & Company, Limited","Description":"No description available.","Image_Url":""}}
{"model":"core.Books_seller","fields":{"Title":"White Teeth","Author":"Zadie Smith","Description":"NATIONAL BESTSELLER • Updated for the 25th Anniversary with a new introduction by the author • The blockbuster debut novel from “a preternaturally gifted” writer (The New York Times) and author of On Beauty and Swing Time—set against London's racial and cultural tapestry, reveling in the ecstatic hodgepodge of modern life, flirting with disaster, and embracing the comedy of daily existence. One of the New York Times’s 100 Best Books of the 21st Century Zadie Smith’s dazzling debut caught critics grasping for comparisons and deciding on everyone from Charles Dickens to Salman Rushdie to John Irving and Martin Amis. But the truth is that Zadie Smith’s voice is remarkably, fluently, and altogether wonderfully her own. At the center of this invigorating novel are two unlikely friends, Archie Jones and Samad Iqbal. Hapless veterans of World War II, Archie and Samad and their families become agents of England’s irrevocable transformation. A second marriage to Clara Bowden, a beautiful, albeit tooth-challenged, Jamaican half his age, quite literally gives Archie a second lease on life, and produces Irie, a knowing child whose personality doesn’t quite match her name (Jamaican for “no problem”). Samad’s late-in-life arranged marriage (he had to wait for his bride to be born), produces twin sons whose separate paths confound Iqbal’s every effort to direct them, and a renewed, if selective, submission to his Islamic faith. “[White Teeth] is, like the London it portrays, a restless hybrid of voices, tones, and textures…with a raucous energy and confidence.” —The New York Times Book Review","Image_Url":"http:\/\/books.google.com\/books\/content?id=zZFlmid0HOYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The House at Riverton","Author":"Kate Morton","Description":"From the author of #1 international bestseller The Forgotten Garden and New York Times bestseller Homecoming comes a gorgeous novel set in England between World War I and World War II. Perfect for fans of Downton Abbey, it is the story of an aristocratic family, a house, a mysterious death and a way of life that vanished forever, told in flashback by a woman who witnessed it all and kept a secret for decades. Grace Bradley went to work at Riverton House as a servant when she was just a girl, before the First World War. For years her life was inextricably tied up with the Hartford family, most particularly the two daughters, Hannah and Emmeline. In the summer of 1924, at a glittering society party held at the house, a young poet shot himself. The only witnesses were Hannah and Emmeline and only they—and Grace—know the truth. In 1999, when Grace is ninety-eight years old and living out her last days in a nursing home, she is visited by a young director who is making a film about the events of that summer. She takes Grace back to Riverton House and reawakens her memories. Told in flashback, this is the story of Grace's youth during the last days of Edwardian aristocratic privilege shattered by war, of the vibrant twenties and the changes she witnessed as an entire way of life vanished forever. The novel is full of secrets—some revealed, others hidden forever, reminiscent of the romantic suspense of Daphne du Maurier. It is also a meditation on memory, the devastation of war and a beautifully rendered window into a fascinating time in history. Kate Morton’s first novel, originally published to critical acclaim in Australia, and quickly becoming a #1 bestseller in England, The House at Riverton is a vivid, page-turning novel of suspense and passion, with characters—and an ending—readers won't soon forget.","Image_Url":"http:\/\/books.google.com\/books\/content?id=AdQhoNVAjkUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Book Thief","Author":"Markus Zusak","Description":"Trying to make sense of the horrors of World War II, Death is fascinated by one young girl, Liesel, whose book-stealing and story-telling talents help sustain her community, especially her family and the Jewish man they are hiding.","Image_Url":"http:\/\/books.google.com\/books\/content?id=_MnZAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Nights of Rain and Stars","Author":"Maeve Binchy","Description":"'They were still talking as the first stars came into the sky...' Four strangers meet at a taverna on a beautiful Greek island, with nothing in common except a need to escape. But over one magical summer they'll discover that sometimes, the people who understand you the best can be the ones who don't know you at all... Fiona left her nursing career in Ireland to be with the man everyone thinks is wrong for her. Elsa fled Germany and her high-powered television job once she learned what the man she loved was hiding from her. Thomas mourns his failed marriage and misses his young son in California, while David yearns to reconcile with his family in England without having to go into the family business. Chance has brought them together, and together they will find new ways of looking at the lives they left behind. ___________ Find out why millions of readers adore Maeve Binchy... 'A story to lift your heart and bring you peace.' (Five stars) 'Maeve Binchy in the sunshine of Greece - what more could one want?' (Five stars) 'Happy and life-affirming' (Five stars) 'The Greek island itself was so real, it made you want to pack a suitcase an rush off to live there.' (Five stars) 'Set on a beautiful Greek island, and as you get caught up in the story you feel as if you have been there yourself.' (Five stars) 'Romance, disappointments, opportunities taken, beautiful Greece all tied up in a holiday package.' (Five stars) ___________ SPECIAL EDITION FEATURING 'MEMORIES OF MAEVE' FROM: Minnie Driver - Marian Keyes - Cathy Kelly - Veronica Henry Jilly Cooper - Lorraine Kelly - Jenny Colgan - Katie Fforde - Ruby Wax Patricia Scanlan - Liz Nugent - Megan Nolan - Maeve's friends & colleagues Introduced by Maeve's husband, Gordon Snell. ___________ 'One of my all-time favourites' LORRAINE KELLY 'An absolute joy. Maeve sweeps you away to an island paradise!' VERONICA HENRY 'A brilliant storyteller' GRAHAM NORTON 'A master storyteller' NEW YORK TIMES 'Maeve Binchy was my hero' MARIAN KEYES 'The Queen of Fiction' IRISH TIMES 'A true star' JILLY COOPER 'A remarkable writer' RUBY WAX 'Wielded her pen with dizzying genius' CATHY KELLY","Image_Url":"http:\/\/books.google.com\/books\/content?id=EEfRe_gKFSsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Ghost ... The Second Edition","Author":"Charles Churchill","Description":"No description available.","Image_Url":"http:\/\/books.google.com\/books\/content?id=Upf6eRp7kzsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Happy Days with the Naked Chef","Author":"Jamie Oliver","Description":"Get cooking simple, comforting food with a twist, with Happy Days with the Naked Chef This cookbook is all about creating simple and homely food, but which is still packed full of flavour and fun. Jamie shows readers that with just a little planning, it is possible to create meals that friends and families will talk about for years to come. As well as loads of delicious recipes, Jamie also gives you some handy tips for getting kids excited about food, and how to have a healthy and balanced diet. Recipes you'll soon be enjoying include: · Good old STEAK and GUINNESS PIE · Layered FOCACCIA with CHEESE and ROCKET · COURGETTE SALAD with MINT, GARLIC, RED CHILLI, LEMON & extra virgin olive oil · PARSNIP & PANCETTA TAGLIATELLE with PARMESAN and BUTTER · Lovely LEMON CURDY PUD Divided into chapters on Herbs, Comfort Grub, Quick Fixes, Kids' Club, More Simple Salads, Dressings, Pasta, Something Fishy Going On, Nice Bit of Meat, And Loads of Veg, The Wonderful World of Bread, Desserts andBevvies, you'll be cooking different and delicious recipes in no time. 'There is only one Jamie Oliver. Great to watch. Great to cook' Delia Smith ____________ Celebrating the 20th anniversary of The Naked Chef Penguin are re-releasing Jamie's first five cookbooks as beautiful Hardback Anniversary Editions - an essential for every kitchen. The Naked Chef The Return of the Naked Chef Happy Days with the Naked Chef Jamie's Kitchen Jamie's Dinners '20 years on . . . Does it stand the test of my kitchen? The answer is a resounding yes. Jamie's genius is in creating maximum flavour from quick, easy-to-follow recipes . . . It hasn't dated at all' Daily Telegraph on The Naked Chef _____________","Image_Url":"http:\/\/books.google.com\/books\/content?id=VweFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Approaching the Hunger Games Trilogy","Author":"Tom Henthorne","Description":"This book addresses Suzanne Collins's work from a number of literary and cultural perspectives in an effort to better understand both its significance and its appeal. It takes an interdisciplinary approach to the Hunger Games trilogy, drawing from literary studies, psychology, gender studies, media studies, philosophy, and cultural studies. An analytical rather than evaluative work, it dispenses with extended theoretical discussions and academic jargon. Assuming that readers are familiar with the entire trilogy, the book also avoids plot summary and character analysis, instead focusing on the significance of the story and its characters. It includes a biographical essay, glossaries, questions for further study, and an extensive bibliography. Instructors considering this book for use in a course may request an examination copy here.","Image_Url":"http:\/\/books.google.com\/books\/content?id=TSSvFxYBu3MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Lost Boy","Author":"Dave Pelzer, David J. Pelzer","Description":"Sequel to A child called It, detailing the author's experiences in foster care after his removal from his abusive home.","Image_Url":"http:\/\/books.google.com\/books\/content?id=Co2jAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"Jamie's Ministry of Food","Author":"Jamie Oliver","Description":"\"The aim of this book is to completely inspire people who have no interest in food to have a go. Sixty years ago food was in short supply and malnutrition rates were high. The Ministry of Food was set up to teach the public how to make the best use of the food available to them. Fast forward to the present day, where we have unlimited choices and plenty of food, yet we're living in a world of junk food, additives and preservatives. Our war is now against obesity, as most people have little or no idea about how to cook and what makes a balanced diet. We need to learn from the past. We need to look back at the way our grandmothers and great-grandmothers cooked - wholesome, tasty food that was simple and quick to prepare.\"--Publisher details.","Image_Url":"http:\/\/books.google.com\/books\/content?id=xH2oLgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}
{"model":"core.Books_seller","fields":{"Title":"The Tragedy of Nan","Author":"John Masefield","Description":"No description available.","Image_Url":"http:\/\/books.google.com\/books\/content?id=-vJLAQAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}
